## Challenge

In this lab, the objective is to identify the customers who were active in both May and June, and how did their activity differ between months. To achieve this, follow these steps:

1. Establish a connection between Python and the Sakila database.

2. Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

	- `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
	- `month`: an integer representing the month for which rental data is to be retrieved.
	- `year`: an integer representing the year for which rental data is to be retrieved.

	The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

3. Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 

	The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".


	*Hint: Consider making use of pandas [groupby()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)*

4. Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. 
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [45]:
# Importamos librerías
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass

# Introducimos contraseña
password = getpass.getpass()

# Elegimos Database
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

2. Write a Python function called `rentals_month` that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

	- `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
	- `month`: an integer representing the month for which rental data is to be retrieved.
	- `year`: an integer representing the year for which rental data is to be retrieved.

	The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [46]:
# Function: `rentals_month`
from sqlalchemy import text

def rentals_month(engine, month, year):
    """
    It retrieves rental data for a given month and year passed as parameters
    from the `Sakila` database as a Pandas DataFrame.
    """
    with engine.connect() as connection:
        query = text('SELECT customer_id, rental_date FROM rental WHERE MONTH(rental_date) = :rental_month AND YEAR(rental_date) = :rental_year')
        result = connection.execute(query, {'rental_month': month, 'rental_year': year})
        df = pd.DataFrame(result.all())
    return df

df = rentals_month(engine, 5, 2005)

df

      customer_id         rental_date
0             130 2005-05-24 22:53:30
1             459 2005-05-24 22:54:33
2             408 2005-05-24 23:03:39
3             333 2005-05-24 23:04:41
4             222 2005-05-24 23:05:21
...           ...                 ...
1151          506 2005-05-31 21:36:44
1152           59 2005-05-31 21:42:09
1153          251 2005-05-31 22:17:11
1154          106 2005-05-31 22:37:34
1155           61 2005-05-31 22:47:45

[1156 rows x 2 columns]

3. Develop a Python function called `rental_count_month` that takes the DataFrame provided by `rentals_month` as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year. 

	The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".


	*Hint: Consider making use of pandas [groupby()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html)*

In [ ]:
def rental_count_month(df, month, year):
    """
    It takes the DataFrame provided by `rentals_month` as input along with the month and the year
    and returns a new_df containing the number of rentals made by each customer_id during the selected
    month and year.
    """
    grouped = df.groupby('customer_id')
    new_df = grouped.size().reset_index(name=f'rentals_{month:02d}_{year}')
    return new_df

     customer_id  rentals_05_2005  rentals_06_2005  difference
0              1                2                7          -5
1              2                1                1           0
2              3                2                4          -2
3              5                3                5          -2
4              6                3                4          -1
..           ...              ...              ...         ...
507          594                4                6          -2
508          595                1                2          -1
509          596                6                2           4
510          597                2                3          -1
511          599                1                4          -3

[512 rows x 4 columns]

4. Create a Python function called `compare_rentals` that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. 
The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [55]:
df1 = rental_count_month(rentals_month(engine, 5, 2005), 5, 2005)
df2 = rental_count_month(rentals_month(engine, 6, 2005), 6, 2005)

def compare_rentals(df1, df2):
    """
    It takes two DataFrames as input containing the number of rentals made by each customer
    in different months and years. It returns a combined DataFrame with a new difference column
    which is the difference between the number of rentals in the two months.
    """
    
    df_merged = pd.merge(df1, df2, on='customer_id')
    df_merged['difference'] = df_merged.iloc[:, 1] - df_merged.iloc[:, 2]
    return df_merged

compare_rentals(df1, df2)

     customer_id  rentals_05_2005  rentals_06_2005  difference
0              1                2                7          -5
1              2                1                1           0
2              3                2                4          -2
3              5                3                5          -2
4              6                3                4          -1
..           ...              ...              ...         ...
507          594                4                6          -2
508          595                1                2          -1
509          596                6                2           4
510          597                2                3          -1
511          599                1                4          -3

[512 rows x 4 columns]